###################################################################

# Created by write_sdc on Fri Apr  5 01:05:21 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions slow -library slow
set_wire_load_mode top
set_wire_load_model -name smic18_wl50 -library slow
set_load -pin_load 10 [get_ports READY]
set_load -pin_load 10 [get_ports OK]
set_load -pin_load 10 [get_ports {DOUT[7]}]
set_load -pin_load 10 [get_ports {DOUT[6]}]
set_load -pin_load 10 [get_ports {DOUT[5]}]
set_load -pin_load 10 [get_ports {DOUT[4]}]
set_load -pin_load 10 [get_ports {DOUT[3]}]
set_load -pin_load 10 [get_ports {DOUT[2]}]
set_load -pin_load 10 [get_ports {DOUT[1]}]
set_load -pin_load 10 [get_ports {DOUT[0]}]
set_ideal_network [get_ports CLK]
set_ideal_network [get_ports RST_]
create_clock [get_ports CLK]  -name clk  -period 40  -waveform {0 20}
set_clock_latency -max 2  [get_clocks clk]
set_clock_latency -source 1  [get_clocks clk]
set_clock_uncertainty 1.3  [get_clocks clk]
set_clock_transition -max -rise 0.5 [get_clocks clk]
set_clock_transition -max -fall 0.5 [get_clocks clk]
set_clock_transition -min -rise 0.5 [get_clocks clk]
set_clock_transition -min -fall 0.5 [get_clocks clk]
set_input_delay -clock clk  -max 6  [get_ports RST_]
set_input_delay -clock clk  -min 4  [get_ports RST_]
set_input_delay -clock clk  -max 6  [get_ports {CMD[1]}]
set_input_delay -clock clk  -min 4  [get_ports {CMD[1]}]
set_input_delay -clock clk  -max 6  [get_ports {CMD[0]}]
set_input_delay -clock clk  -min 4  [get_ports {CMD[0]}]
set_input_delay -clock clk  -max 6  [get_ports {DIN[7]}]
set_input_delay -clock clk  -min 4  [get_ports {DIN[7]}]
set_input_delay -clock clk  -max 6  [get_ports {DIN[6]}]
set_input_delay -clock clk  -min 4  [get_ports {DIN[6]}]
set_input_delay -clock clk  -max 6  [get_ports {DIN[5]}]
set_input_delay -clock clk  -min 4  [get_ports {DIN[5]}]
set_input_delay -clock clk  -max 6  [get_ports {DIN[4]}]
set_input_delay -clock clk  -min 4  [get_ports {DIN[4]}]
set_input_delay -clock clk  -max 6  [get_ports {DIN[3]}]
set_input_delay -clock clk  -min 4  [get_ports {DIN[3]}]
set_input_delay -clock clk  -max 6  [get_ports {DIN[2]}]
set_input_delay -clock clk  -min 4  [get_ports {DIN[2]}]
set_input_delay -clock clk  -max 6  [get_ports {DIN[1]}]
set_input_delay -clock clk  -min 4  [get_ports {DIN[1]}]
set_input_delay -clock clk  -max 6  [get_ports {DIN[0]}]
set_input_delay -clock clk  -min 4  [get_ports {DIN[0]}]
set_output_delay -clock clk  -max 6  [get_ports READY]
set_output_delay -clock clk  -min 4  [get_ports READY]
set_output_delay -clock clk  -max 6  [get_ports OK]
set_output_delay -clock clk  -min 4  [get_ports OK]
set_output_delay -clock clk  -max 6  [get_ports {DOUT[7]}]
set_output_delay -clock clk  -min 4  [get_ports {DOUT[7]}]
set_output_delay -clock clk  -max 6  [get_ports {DOUT[6]}]
set_output_delay -clock clk  -min 4  [get_ports {DOUT[6]}]
set_output_delay -clock clk  -max 6  [get_ports {DOUT[5]}]
set_output_delay -clock clk  -min 4  [get_ports {DOUT[5]}]
set_output_delay -clock clk  -max 6  [get_ports {DOUT[4]}]
set_output_delay -clock clk  -min 4  [get_ports {DOUT[4]}]
set_output_delay -clock clk  -max 6  [get_ports {DOUT[3]}]
set_output_delay -clock clk  -min 4  [get_ports {DOUT[3]}]
set_output_delay -clock clk  -max 6  [get_ports {DOUT[2]}]
set_output_delay -clock clk  -min 4  [get_ports {DOUT[2]}]
set_output_delay -clock clk  -max 6  [get_ports {DOUT[1]}]
set_output_delay -clock clk  -min 4  [get_ports {DOUT[1]}]
set_output_delay -clock clk  -max 6  [get_ports {DOUT[0]}]
set_output_delay -clock clk  -min 4  [get_ports {DOUT[0]}]
set_input_transition -max 0.5  [get_ports CLK]
set_input_transition -min 0.5  [get_ports CLK]
set_input_transition -max 0.5  [get_ports RST_]
set_input_transition -min 0.5  [get_ports RST_]
set_input_transition -max 0.5  [get_ports {CMD[1]}]
set_input_transition -min 0.5  [get_ports {CMD[1]}]
set_input_transition -max 0.5  [get_ports {CMD[0]}]
set_input_transition -min 0.5  [get_ports {CMD[0]}]
set_input_transition -max 0.5  [get_ports {DIN[7]}]
set_input_transition -min 0.5  [get_ports {DIN[7]}]
set_input_transition -max 0.5  [get_ports {DIN[6]}]
set_input_transition -min 0.5  [get_ports {DIN[6]}]
set_input_transition -max 0.5  [get_ports {DIN[5]}]
set_input_transition -min 0.5  [get_ports {DIN[5]}]
set_input_transition -max 0.5  [get_ports {DIN[4]}]
set_input_transition -min 0.5  [get_ports {DIN[4]}]
set_input_transition -max 0.5  [get_ports {DIN[3]}]
set_input_transition -min 0.5  [get_ports {DIN[3]}]
set_input_transition -max 0.5  [get_ports {DIN[2]}]
set_input_transition -min 0.5  [get_ports {DIN[2]}]
set_input_transition -max 0.5  [get_ports {DIN[1]}]
set_input_transition -min 0.5  [get_ports {DIN[1]}]
set_input_transition -max 0.5  [get_ports {DIN[0]}]
set_input_transition -min 0.5  [get_ports {DIN[0]}]
